<template>
    <UContainer>
        <h1 class="text-4xl font-bold mb-6 text-gray-800 dark:text-gray-300 text-center">
            Покраска фасада: Процесс работы и цена:
        </h1>
        <div class="flex gap-8 justify-center">
            <img src="/pokraska/fasad1.jpg" alt="покраска фасада"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
            <img src="/pokraska/fasad2.jpg" alt="покраска фасада"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
        </div>
        <div>
            <h2 class="text-xl font-semibold text-gray-700 dark:text-gray-300 mb-4">
                Покраска фасада - это трудоемкий рабочий этап в обновлении внешнего вида здания. Процесс покраски фасада
                включает в себя несколько этапов:

            </h2>
            <ol class="list-decimal pl-6 mb-4">
                <li class="mb-2">Выбор краски: Фасадные краски имеют ряд преимуществ, так как они обладают широким
                    диапазоном температур, в отличии от интерьерной краски. Все фасадные краски обладают повышенными
                    качественными показателями, его устойчивость по отношению к внешним факторам, устойчива к внешним
                    воздействиям – влаге, ветру, осадкам</li>
                <li class="mb-2">
                    Перед покраской необходимо проверить прочность основания, проведя по нему металлическим шпателем. Если
                    от фасада отслаиваются или осыпается старая краска или иные материалы, необходимо их убрать и локально
                    зашпаклевать.
                </li>
                <li class="mb-2">В зависимости от размеров фасадов краску можно наносить валиком, или же механизированным
                    аппаратом. Для фасадных красок на водной основе важно соблюдать погодные условия и влажность воздуха при
                    нанесении и до полного высыхания материала. Рекомендуемая температура нанесения – не ниже плюс 10°С
                    градусов.</li>
            </ol>
        </div>
        <div>
            <h2 class="text-2xl font-bold mb-4 text-gray-800 dark:text-gray-300">Цены на покраску фасада</h2>
            <UTable :rows="people" />
        </div>
        <div>
            <p class="text-base text-gray-700 dark:text-gray-300 mb-6">
                Выбор метода зависит от ваших предпочтений и доступных инструментов. Пожалуйста, учтите, что это общие
                рекомендации, и конкретные методы могут варьироваться в зависимости от поверхности и материалов.
            </p>
        </div>
        <div class="mb-16">
            <p class="text-base text-gray-700 dark:text-gray-300 mb-24 font-semibold">
                Все цены указаны предварительно ориентировочные. Полная смета и стоимость работ оговаривается на объекте.
            </p>
        </div>
    </UContainer>
</template>

<script setup lang="ts">
const people = [{
    Наименование: 'Очистка поверхности от грязи',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Грунтование поверхности',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Покраска кирпичной стены 1 слой',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Покраска кирпичной стены 2 слоя',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Дополнительные работы',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: '',
    Единицаизмерения: 'кв.м.',
    цена: '',
}]
</script>

<style lang="scss" scoped>
</style>
