<template>
  <UContainer>
    <h1 class="text-4xl font-bold mb-6 text-gray-800 dark:text-gray-300 text-center">
      Покраска кирпичных стен, процесс работы и цена
    </h1>
    <div class="flex gap-8 justify-center">
      <img src="/pokraska/kirpich2.jpg" alt="покраска кирпича"
        class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
      <img src="/pokraska/kirpich1.png" alt="покраска кирпича"
        class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
    </div>
    <div>
      <h2 class="text-xl font-semibold text-gray-700 dark:text-gray-300 mb-4">
        Покраска стен под кирпич включает в себя несколько этапов:
      </h2>
      <ol class="list-decimal pl-6 mb-4">
        <li class="mb-2">Подготовка стены: перед покраской стену необоходимо загрутовать</li>
        <li class="mb-2">
          Выбор краски: правильно подобранной краской можно покрасить кирпич в любой цвет
          для покраски кирпича обычно используется акриловая, матовая краска для фасадов.
        </li>
        <li class="mb-2">Покраска: при покраске стены используются разные кисти для швов и кирпича.</li>
        <li class="mb-2">Завершение: благодаря эксплуатационным свойствам краски, покрашеный кирпич не поменяет свой
          цвет
        </li>
      </ol>
    </div>
    <div>
      <h2 class="text-2xl font-bold mb-4 text-gray-800 dark:text-gray-300">Цены на покраску кирпича</h2>
      <UTable :rows="people" />
    </div>
    <div>
      <p class="text-base text-gray-700 dark:text-gray-300 mb-6">
        Выбор метода зависит от ваших предпочтений и доступных инструментов. Пожалуйста, учтите, что это общие
        рекомендации, и конкретные методы могут варьироваться в зависимости от поверхности и материалов.
      </p>
    </div>
    <div class="mb-36 md:mb-16">
      <p class="text-base text-gray-700 dark:text-gray-300 mb-24 font-semibold">
        Все цены указаны предварительно ориентировочные. Полная смета и стоимость работ оговаривается на объекте.
      </p>
    </div>
  </UContainer>
</template>

<script setup lang="ts">
const people = [{
  Наименование: 'Очистка поверхности от грязи',
  Единицаизмерения: 'м²',
  цена: 'от 40₽',
}, {
  Наименование: 'Грунтование поверхности',
  Единицаизмерения: 'м²',
  цена: 'от 50₽',
}, {
  Наименование: 'Покраска кирпичной стены 1 слой',
  Единицаизмерения: 'м²',
  цена: 'от 150₽',
}, {
  Наименование: 'Покраска кирпичной стены 2 слоя',
  Единицаизмерения: 'м²',
  цена: 'от 250₽',
}, {
  Наименование: 'Дополнительные работы',
  Единицаизмерения: 'ед.',
  цена: 'На объекте',
},]
</script>

<style lang="scss" scoped></style>
