<template>
    <UContainer>
        <h1 class="text-4xl font-bold mb-6 text-gray-800 dark:text-gray-300 text-center">
            Покраска металлических конструкций: процесс работы и цена:
        </h1>
        <div class="flex gap-8 justify-center">
            <img src="/pokraska/metall1.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
            <img src="/pokraska/metall2.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
        </div>
        <div>
            <h2 class="text-xl font-semibold text-gray-700 dark:text-gray-300 mb-4">
                Покраска металла - это процесс, который требует определенных навыков и знаний. Вот некоторые основные
                рекомендации:
            </h2>
            <ol class="list-decimal pl-6 mb-4">
                <li class="mb-2">Подготовка: Перед нанесением краски металл необходимо тщательно подготовить. Это
                    включает в
                    себя очистку поверхности от ржавчины, этот этап важен для обеспечения хорошей адгезии краски.</li>
                <li class="mb-2">
                    Выбор инструмента: Окрасить металл можно с помощью кистей, валиков, компрессоров или безвоздушным
                    распылением. Кистью рекомендуется окрашивать узкие элементы для экономии краски, такие как садовые
                    ограды, скамейки, решётки. Валиком или методом распыления – ровные поверхности большой площади:
                    металла-конструкции листы железа и т.п.
                </li>
                <li class="mb-2">Нанесение грунтовки для улучшения адгезии краски и защиты металла.</li>
                <li class="mb-2">.Нанесение лакокрасочного изделия: Рекомендуется наносить лакокрасочный материал при
                    температуре не менее +5°С и не выше +30°С для предотвращение потеков краски, а так же избежать
                    быстрого
                    высыхания материала.
                </li>
            </ol>
            <p class="mb-2">
                Пожалуйста, учтите, что все операции должны осуществляться по очередности с соблюдением всех технологий
                , чтобы состав в дальнейшем имел хорошую адгезию, и прослужил на много дольше.
            </p>
        </div>
        <div>
            <h2 class="text-2xl font-bold mb-4 text-gray-800 dark:text-gray-300">Цены на покраску металла</h2>
            <UTable :rows="people" />
        </div>
        <div>
            <p class="text-base text-gray-700 dark:text-gray-300 mb-6">
                Выбор метода зависит от ваших предпочтений и доступных инструментов. Пожалуйста, учтите, что это общие
                рекомендации, и конкретные методы могут варьироваться в зависимости от поверхности и материалов.
            </p>
        </div>
        <div class="mb-36 md:mb-16">
            <p class="text-base text-gray-700 dark:text-gray-300 mb-24 font-semibold">
                Все цены указаны предварительно ориентировочные. Полная смета и стоимость работ оговаривается на
                объекте.
            </p>
        </div>
    </UContainer>
</template>

<script setup lang="ts">
const people = [{
    Наименование: 'Очистка металла от старой краски',
    Единицаизмерения: 'м²',
    цена: 'от 60₽',
}, {
    Наименование: 'Обезжиривание металла',
    Единицаизмерения: 'м²',
    цена: 'от 50₽',
}, {
    Наименование: 'Грунтование эмалью',
    Единицаизмерения: 'м²',
    цена: 'от 130₽',
}, {
    Наименование: 'Покраска металла эмалью',
    Единицаизмерения: 'м²',
    цена: 'от 180₽',
}, {
    Наименование: 'Покраска металла на водной основе',
    Единицаизмерения: 'м²',
    цена: 'от 150₽',
}, {
    Наименование: 'Дополнительные работы',
    Единицаизмерения: 'м²',
    цена: 'На объекте',
}]
</script>

<style lang="scss" scoped></style>
