<template>
    <UContainer>
        <h1 class="text-4xl font-bold mb-6 text-gray-800 dark:text-gray-300 text-center">
            Покраска монолитных конструкций , процесс работы и цена:
        </h1>
        <div class="flex gap-8 justify-center">
            <img src="/pokraska/beton1.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
            <img src="/pokraska/potolok.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
        </div>
        <div>
            <h2 class="text-xl font-semibold text-gray-700 dark:text-gray-300 mb-4">
                Покраска монолитных конструкций – это процесс, который требует тщательной подготовки и правильного выбора
                материалов и покрасочного оборудования для наилучшего результата.
            </h2>
            <ol class="list-decimal pl-6 mb-4">
                <li class="mb-2">Подготовка поверхности: Перед покраской бетон нужно тщательно очистить от дефектов после
                    его заливки.</li>
                <li class="mb-2">
                    Нанесение грунтовки: Грунтовка помогает улучшить адгезию краски к бетону и увеличивает долговечность
                    покрытия.
                </li>
                <li class="mb-2">Подбор инструментов и материалов: Необходимо выбрать подходящие инструменты и материалы для
                    работы что бы прокрасить тщательно поверхность бетона.</li>
                <li class="mb-2">Нанесение краски: Краску следует наносить равномерно, следуя инструкциям производителя. Для
                    достижения лучшего результата покрытия рекомендуется использовать краскопульты.
                </li>
            </ol>
            <div>
                <p class="mb-4"> Помните, что каждый вид
                    краски имеет свои особенности и требует определенного подхода при нанесении, перед покупкой материала
                    проконсультируйтесь со специалистом.</p>
            </div>
        </div>
        <div>
            <h2 class="text-2xl font-bold mb-4 text-gray-800 dark:text-gray-300">Цены на покраску монолита</h2>
            <UTable :rows="people" />
        </div>
        <div>
            <p class="text-base text-gray-700 dark:text-gray-300 mb-6">
                Выбор метода зависит от ваших предпочтений и доступных инструментов. Пожалуйста, учтите, что это общие
                рекомендации, и конкретные методы могут варьироваться в зависимости от поверхности и материалов.
            </p>
        </div>
        <div class="mb-16">
            <p class="text-base text-gray-700 dark:text-gray-300 mb-24 font-semibold">
                Все цены указаны предварительно ориентировочные. Полная смета и стоимость работ оговаривается на объекте.
            </p>
        </div>
    </UContainer>
</template>

<script setup lang="ts">
const people = [{
    Наименование: 'Очистка поверхности бетона',
    Единицаизмерения: 'м²,',
    цена: 'от 50₽',
}, {
    Наименование: 'Грунтование монолита',
    Единицаизмерения: 'м²',
    цена: 'от 50₽',
}, {
    Наименование: 'Покраска монолита 1 слой',
    Единицаизмерения: 'м²',
    цена: 'от 150₽',
}, {
    Наименование: 'Покраска монолита 2 слоя',
    Единицаизмерения: 'м²',
    цена: 'от 250₽',
}, {
    Наименование: 'Дополнительные работы',
    Единицаизмерения: 'ед.',
    цена: 'На объекте',
},]
</script>

<style lang="scss" scoped>
</style>
