<template>
    <UContainer>
        <h1 class="text-4xl font-bold mb-6 text-gray-800 dark:text-gray-300 text-center">
            Покраска обоев: процесс работы и цена:
        </h1>
        <div class="flex gap-8 justify-center">
            <img src="/pokraska/oboi1.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
            <img src="/pokraska/oboi2.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
        </div>
        <div>
            <h2 class="text-xl font-semibold text-gray-700 dark:text-gray-300 mb-4">
                Покраска обоев - это не только удобный способ бюджетно освежить стены, но и способ показать свой стиль.
                Вот
                несколько полезных советов по покраске обоев:
            </h2>
            <ol class="list-decimal pl-6 mb-4">
                <li class="mb-2">Грунтование: Перед покраской обоев необходимо обработать грунтом. Грунт помогает
                    избежать
                    проникновение ЛКМ через полотно к клею,, что скажется на надежности покрытия. То есть обои могут
                    попросту отойти от стены. Грунт является барьером между краской и клеем.</li>
                <li class="mb-2">
                    Подготовка: Убедитесь, что наклеенные обои или стеклохолст на стене высохли, так же перед
                    окрашиванием
                    обоев необходимо проверить и подклеить места где обои отошли. После покраски обоев пузыри будут
                    более
                    видны, и подклеить эти места не испачкав стену будет затруднительно.
                </li>
                <li class="mb-2">Способы нанесения ЛКМ: Наносить окрасочный материал на не крашенные обои рекомендуется
                    валиком , для лучшего пропитания полотна улучшая адгезию материала. В случае если обои были ранее
                    окрашенные хотя бы в 1 слой , для достижения равномерного нанесения окрасочного материала
                    рекомендуется
                    использовать технологию безвоздушной покраски.</li>

            </ol>
            <p class="mb-2">
                Пожалуйста, учтите, что все операции должны осуществляться по очередности с соблюдением всех технологий
                , чтобы состав в дальнейшем имел хорошую адгезию, и прослужил на много дольше.
            </p>
        </div>
        <div>
            <h2 class="text-2xl font-bold mb-4 text-gray-800 dark:text-gray-300">Цены на покраску обоев</h2>
            <UTable :rows="people" />
        </div>
        <div>
            <p class="text-base text-gray-700 dark:text-gray-300 mb-6">
                Выбор метода зависит от ваших предпочтений и доступных инструментов. Пожалуйста, учтите, что это общие
                рекомендации, и конкретные методы могут варьироваться в зависимости от поверхности и материалов.
            </p>
        </div>
        <div class="mb-36 md:mb-16">
            <p class="text-base text-gray-700 dark:text-gray-300 mb-24 font-semibold">
                Все цены указаны предварительно ориентировочные. Полная смета и стоимость работ оговаривается на
                объекте.
            </p>
        </div>
    </UContainer>
</template>

<script setup lang="ts">
const people = [{
    Наименование: 'Подклейка обоев',
    Единицаизмерения: 'м²,',
    цена: 'На объекте',
}, {
    Наименование: 'Грунтование обоев',
    Единицаизмерения: 'м²',
    цена: 'от 50₽',
}, {
    Наименование: 'Освежить старые обои 1 слой',
    Единицаизмерения: 'м²',
    цена: 'от 150₽',
}, {
    Наименование: 'Покраска новых обоев 2 слоя',
    Единицаизмерения: 'м²',
    цена: 'от 250₽',
}, {
    Наименование: 'Дополнительные работы',
    Единицаизмерения: 'ед.',
    цена: 'На объекте',
},]
</script>

<style lang="scss" scoped></style>
