<template>
    <UContainer>
        <h1 class="text-4xl font-bold mb-6 text-gray-800 dark:text-gray-300 text-center">
            Покраска забора: Процесс работы и цена:
        </h1>
        <div class="flex gap-8 justify-center">
            <img src="/pokraska/zabor1.png" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
            <img src="/pokraska/zabor2.jpg" alt="покраска кирпича"
                class="object-cover rounded shadow-lg mb-6 w-1/2 md:w-1/3 lg:w-1/3 md:h-[380px] h-[150px]">
        </div>
        <div>
            <h2 class="text-xl font-semibold text-gray-700 dark:text-gray-300 mb-4">
                Покраска забора - это специфический процесс, который зависит от многих факторов, включая основание забора,
                его состояние, и материал для окрашивания. Вот некоторые общие рекомендации:
            </h2>
            <ol class="list-decimal pl-6 mb-4">
                <li class="mb-2">Подготовка: Перед началом покраски забора необходимо провести ряд работ. Который включает
                    очистку забора от грязи и пыли, необходимо убрать старую краску или эмаль с помощью инструментов или
                    специальных размягчающих средств. </li>
                <li class="mb-2">
                    Грунтование: Перед покраской забора необходимо загрунтовать поверхность грунтовкой тем самым увеличить
                    адгезию будь это бетонный или же кирпичный забор, в случае металлического так же необходимо загрунтовать
                    поверхность забора, грунт создаст защиту от ржавчины и воздействия сырости, дождя, снега и.т.п.
                </li>
                <li class="mb-2">Выбор краски: Выбор краски зависит от основания забора. Для бетонных заборов можно
                    использовать специальные фасадные краски для бетона. Для деревянных заборов можно использовать
                    антисептические пропитки, которые увеличивают срок службы дереву, а так же защищают древесину от
                    вредителей и грибка. </li>
                <li class="mb-2">Нанесение краски: Краску можно наносить различными способами, Выбор метода покраски зависит
                    от размера забора, его основания, так же от типа краски и ваших личных предпочтений. Если вам нужно
                    быстро покрасить забор, то наиболее эффективным способом будет механизированная покраска.
                </li>
            </ol>
        </div>
        <div>
            <h2 class="text-2xl font-bold mb-4 text-gray-800 dark:text-gray-300">Цены на покраску кирпича</h2>
            <UTable :rows="people" />
        </div>
        <div>
            <p class="text-base text-gray-700 dark:text-gray-300 mb-6">
                Выбор метода зависит от ваших предпочтений и доступных инструментов. Пожалуйста, учтите, что это общие
                рекомендации, и конкретные методы могут варьироваться в зависимости от поверхности и материалов.
            </p>
        </div>
        <div class="mb-16">
            <p class="text-base text-gray-700 dark:text-gray-300 mb-24">
                Все цены указаны предварительно ориентировочные. Полная смета и стоимость работ оговаривается на объекте.
            </p>
        </div>
    </UContainer>
</template>

<script setup lang="ts">
const people = [{
    Наименование: 'Очистка поверхности от грязи',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Грунтование поверхности',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Покраска кирпичной стены 1 слой',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Покраска кирпичной стены 2 слоя',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: 'Дополнительные работы',
    Единицаизмерения: 'кв.м.',
    цена: '',
}, {
    Наименование: '',
    Единицаизмерения: 'кв.м.',
    цена: '',
}]
</script>

<style lang="scss" scoped>
</style>
